{
  "skills": [
    {
      "name": "Javascript",
      "color": "#ffa500",
      "about": "JavaScript é uma linguagem de programação interpretada estruturada, de script em alto nível com tipagem dinâmica fraca e multiparadigma. Juntamente com HTML e CSS, o JavaScript é uma das três principais tecnologias da internet. JavaScript permite páginas da Web interativas e, portanto, é uma parte essencial dos aplicativos da web. A grande maioria dos sites usa, e todos os principais navegadores têm um mecanismo JavaScript dedicado para executá-lo."
    },{
      "name": "Typescript",
      "color": "#2e75c3",
      "about": "TypeScript é um superconjunto de JavaScript desenvolvido pela Microsoft que adiciona tipagem e alguns outros recursos a linguagem. Anders Hejlsberg, arquiteto da linguagem C# e criador das linguagens Delphi e Turbo Pascal, trabalhou no desenvolvimento do TypeScript. A linguagem pode ser usada para desenvolver aplicações JavaScript no lado cliente e lado servidor."
    },{
      "name": "Node.js",
      "color": "#79bb44",
      "about": "Node.js é um software de código aberto, multiplataforma, que executa códigos JavaScript no backend/servidor e frontend/interface, baseado no V8 interpretador de JavaScript em C++ do Google, mantido pela fundação Node.js em parceria com a Linux Foundation."
    },{
      "name": "ReactJS",
      "color": "#2bade8",
      "about": "O React é uma biblioteca JavaScript de código aberto com foco em criar interfaces de usuário em páginas web. É mantido pelo Facebook, Instagram, outras empresas e uma comunidade de desenvolvedores individuais. É utilizado nos sites da Netflix, Imgur, Feedly, Airbnb, SeatGeek, HelloSign, Walmart e outros."
    },{
      "name": "HTML5",
      "color": "#dc4f19",
      "about": "HTML5 (Hypertext Markup Language, versão 5) é uma linguagem de marcação para a World Wide Web e é uma tecnologia chave da Internet, originalmente proposto por Opera Software. É a quinta versão da linguagem HTML. Esta nova versão traz consigo importantes mudanças quanto ao papel do HTML no mundo da Web, através de novas funcionalidades como semântica e acessibilidade."
    },{
      "name": "CSS3",
      "color": "#3e98d4",
      "about": "CSS3 é a terceira mais nova versão das famosas Cascading Style Sheets, pela qual se define estilos para um projeto web. Com efeitos de transição, imagem, imagem de fundo/background e outros, pode-se criar estilos únicos para seus projetos web, alterando diversos aspectos de design no layout da página."
    },{
      "name": "Sass",
      "color": "#c86193",
      "about": "Sass é uma linguagem de folhas de estilo concebida inicialmente por Hampton Catlin e desenvolvida por Natalie Weizenbaum. Depois de suas versões iniciais, Weizenbaum e Chris Eppstein continuaram a estender Sass com SassScript, uma simples linguagem de script usada em arquivos Sass."
    },{
      "name": "Expo",
      "color": "#0f72b6",
      "about": "Expo é uma plataforma de código aberto para fazer aplicativos nativos universais para Android, iOS e web com JavaScript e React."
    },{
      "name": "Next.JS",
      "color": "#000000",
      "about": "Next.js é um framework React com foco em produção e eficiência criado e mantido pela equipe da Vercel, o Nextjs busca reunir diversas funcionalidades como renderização hibrida e estática de conteúdo, suporte a TypeScript, pre-fetching, sistema de rotas, pacotes de funcionalidades e diversos plugins e exemplos para acelerar seu desenvolvimento fornecendo uma estrutura completa para você iniciar seu projeto. Inclusive esse site [e feito em Next.js"
    },{
      "name": "Scrum",
      "color": "#2e75c3",
      "about": "O Scrum é um framework de gerenciamento de projetos, da organização ao desenvolvimento ágil de produtos complexos e adaptativos com o mais alto valor possível, através de várias técnicas, utilizado desde o início de 1990 e que atualmente é utilizado em mais de 60% dos projetos ágeis em todo o mundo."
      
    }
  ],
  "projects": [
    {
      "name": "Chronos",
      "theme": "/projects/chronos.jpeg",
      "colorBackground": "#ffffff",
      "tags": ["EXPO", "REACT NATIVE", "JAVASCRIPT"]
    },{
      "name": "Checklist",
      "theme": "/projects/checklist.jpeg",
      "colorBackground": "#4dd8eb",
      "tags": ["EXPO", "REACT NATIVE", "JAVASCRIPT"]
    },{
      "name": "DOE",
      "theme": "https://github.com/sudo-victor/doe/blob/master/public/logo.png?raw=true",
      "colorBackground": "#f9f9f9",
      "tags": ["NODE.JS", "JAVASCRIPT", "HTML5/CSS3", "POSTGRESQL"]
    }
  ]
}
